Notes/daily/2022-01-23.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>2022-01-23</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/simple.min.css" /><link rel="stylesheet" href="/custom.css" />
</head>
<body>
<div id="preamble" class="status">

<div class="header">
    <span class="title">2022-01-23</span>
    <div class="links">
        <a href="/">Home</a>
        <a href="/Notes/daily/2022-01-23.html">Latest daily</a>
        <a href="https://github.com/Minion3665/EPQ/issues/new">Report issue</a>
        <a href="https://github.com/Minion3665/EPQ">View source</a>
    </div>
</div>
</div>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org679a10c">Diary entry</a>
<ul>
<li><a href="#orgba10597">What have I done since the last entry?</a></li>
<li><a href="#org0acbe53">What have I learned &amp; how?</a></li>
<li><a href="#org3d58f49">What worked well?</a></li>
<li><a href="#org1c874db">What would I do differently next time?</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org679a10c" class="outline-2">
<h2 id="org679a10c">Diary entry</h2>
<div class="outline-text-2" id="text-org679a10c">
</div>
<div id="outline-container-orgba10597" class="outline-3">
<h3 id="orgba10597">What have I done since the last entry?</h3>
<div class="outline-text-3" id="text-orgba10597">
<ul class="org-ul">
<li>I have looked a little at <a href="file:///home/runner/EPQ/Documents/project-improvements.html">how my project could be improved</a>, most of the changes are changes in evaluation rather than in content, but this is still just as important.</li>
<li>I looked at the webinars on skill development and ongoing reflection (see moodle) and took notes on how this could be applied to my project</li>
<li>I took a look at <a href="https://www.cni.dev/">CNI</a> and <a href="https://mobyproject.org/">moby</a> which look like they could be incredibly helpful for container networking. I still need to look further at how to setup CNI with the existing container program I have, but once that is done I will have a first prototype of the program (sans-API).</li>
<li>I used <a href="https://cs.github.com/">the preview of github code search (which I have access to)</a> in order to look at some existing CNI code. I believe that CNI is a daemon on my system so it will need more setup than just go code but looking at that is still a good start</li>
<li>I looked at <a href="https://github.com/containerd/go-cni">go-cni</a>, a module designed to use CNI with containerd</li>
</ul>
</div>
</div>
<div id="outline-container-org0acbe53" class="outline-3">
<h3 id="org0acbe53">What have I learned &amp; how?</h3>
<div class="outline-text-3" id="text-org0acbe53">
<ul class="org-ul">
<li>I've learned a bit more about how to evaluate my project, a skill which I will apply in future evaluations and diary entries</li>
<li>I've learned a bit more about how networking works, and gained skills in using code-search to view and understand other people's code. This is an important skill to have as being able to read and understand other people's code is useful to learning how different things work and are implemented. In addition, the first documentation on containerd that you will find is extremely lacking and while there is some stuff if you dig for it looking at other people's code can be a catalyst for better understanding how different functions fit together.</li>
</ul>
</div>
</div>
<div id="outline-container-org3d58f49" class="outline-3">
<h3 id="org3d58f49">What worked well?</h3>
<div class="outline-text-3" id="text-org3d58f49">
<ul class="org-ul">
<li>Using code-search whent really well</li>
<li>The ongoing reflection webinar was extremely helpful to understand how I could better use reflection and evaluation in my project</li>
</ul>
</div>
</div>
<div id="outline-container-org1c874db" class="outline-3">
<h3 id="org1c874db">What would I do differently next time?</h3>
<div class="outline-text-3" id="text-org1c874db">
<ul class="org-ul">
<li>Next time I'd ignore the skill development webinar; it was not very useful as I already knew and understood the content and have already done stuff like the <a href="../20211212220043-skillsplosion.html#ID-af7d5308-49fa-4ed5-b9d7-630ffb44121b">Skillsplosion</a> which did not need to be replicated.</li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
